## Staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 16 to add, 5 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                         NAME                                                         |
|----------|----------------------------------------------------------------------------------------------------------------------|
| recreate | `module.notify_slack_critical.module.lambda.null_resource.archive[0]`                                                |
|          | `module.notify_slack_general.module.lambda.null_resource.archive[0]`                                                 |
|          | `module.notify_slack_ok.module.lambda.null_resource.archive[0]`                                                      |
|          | `module.notify_slack_warning.module.lambda.null_resource.archive[0]`                                                 |
| add      | `module.notify_slack_critical.aws_sns_topic_subscription.sns_notify_slack[0]`                                        |
|          | `module.notify_slack_general.aws_sns_topic_subscription.sns_notify_slack[0]`                                         |
|          | `module.notify_slack_ok.aws_sns_topic_subscription.sns_notify_slack[0]`                                              |
|          | `module.notify_slack_warning.aws_sns_topic_subscription.sns_notify_slack[0]`                                         |
|          | `module.notify_slack_critical.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]` |
|          | `module.notify_slack_critical.module.lambda.local_file.archive_plan[0]`                                              |
|          | `module.notify_slack_general.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`  |
|          | `module.notify_slack_general.module.lambda.local_file.archive_plan[0]`                                               |
|          | `module.notify_slack_ok.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`       |
|          | `module.notify_slack_ok.module.lambda.local_file.archive_plan[0]`                                                    |
|          | `module.notify_slack_warning.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`  |
|          | `module.notify_slack_warning.module.lambda.local_file.archive_plan[0]`                                               |
| update   | `module.budget_notifier.aws_lambda_function.spend_notifier`                                                          |
|          | `module.notify_slack_critical.module.lambda.aws_lambda_function.this[0]`                                             |
|          | `module.notify_slack_general.module.lambda.aws_lambda_function.this[0]`                                              |
|          | `module.notify_slack_ok.module.lambda.aws_lambda_function.this[0]`                                                   |
|          | `module.notify_slack_warning.module.lambda.aws_lambda_function.this[0]`                                              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.budget_notifier.aws_cloudwatch_event_rule.daily_budget_spend[0] has moved to module.budget_notifier.aws_cloudwatch_event_rule.daily_budget_spend
    resource "aws_cloudwatch_event_rule" "daily_budget_spend" {
        id                  = "dailyBudgetSpend"
        name                = "dailyBudgetSpend"
        tags                = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_cloudwatch_event_rule.weekly_budget_spend[0] has moved to module.budget_notifier.aws_cloudwatch_event_rule.weekly_budget_spend
    resource "aws_cloudwatch_event_rule" "weekly_budget_spend" {
        id                  = "weeklyBudgetSpend"
        name                = "weeklyBudgetSpend"
        tags                = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_cloudwatch_event_target.daily_budget_spend[0] has moved to module.budget_notifier.aws_cloudwatch_event_target.daily_budget_spend
    resource "aws_cloudwatch_event_target" "daily_budget_spend" {
        id             = "dailyBudgetSpend-terraform-20240327132210976400000004"
        # (5 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_cloudwatch_event_target.weekly_budget_spend[0] has moved to module.budget_notifier.aws_cloudwatch_event_target.weekly_budget_spend
    resource "aws_cloudwatch_event_target" "weekly_budget_spend" {
        id             = "weeklyBudgetSpend-terraform-20240327132210976100000003"
        # (5 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_lambda_function.spend_notifier will be updated in-place
  ~ resource "aws_lambda_function" "spend_notifier" {
        id                             = "spend_notifier"
      ~ last_modified                  = "2024-09-12T17:20:56.000+0000" -> (known after apply)
      ~ runtime                        = "nodejs20.x" -> "nodejs16.x"
      ~ source_code_hash               = "1vH83BDA1sIoBtTcwyvC2n+w932l6mJkelGZEWjy0pU=" -> "KqgaQgrKH72tPtzVxEXFeT0UIdVJmB8W7Q3/O5onycQ="
        tags                           = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.budget_notifier.aws_lambda_permission.allow_daily_budget[0] has moved to module.budget_notifier.aws_lambda_permission.allow_daily_budget
    resource "aws_lambda_permission" "allow_daily_budget" {
        id            = "AllowDailyBudget"
        # (5 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_lambda_permission.allow_weekly_budget[0] has moved to module.budget_notifier.aws_lambda_permission.allow_weekly_budget
    resource "aws_lambda_permission" "allow_weekly_budget" {
        id            = "AllowWeeklyBudget"
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_critical.aws_sns_topic_subscription.sns_notify_slack[0] will be created
  + resource "aws_sns_topic_subscription" "sns_notify_slack" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ca-central-1:239043911459:alert-critical"
    }

  # module.notify_slack_general.aws_sns_topic_subscription.sns_notify_slack[0] will be created
  + resource "aws_sns_topic_subscription" "sns_notify_slack" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-general"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ca-central-1:239043911459:alert-general"
    }

  # module.notify_slack_ok.aws_sns_topic_subscription.sns_notify_slack[0] will be created
  + resource "aws_sns_topic_subscription" "sns_notify_slack" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ca-central-1:239043911459:alert-ok"
    }

  # module.notify_slack_warning.aws_sns_topic_subscription.sns_notify_slack[0] will be created
  + resource "aws_sns_topic_subscription" "sns_notify_slack" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ca-central-1:239043911459:alert-warning"
    }

  # module.notify_slack_critical.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "notify-slack-critical"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical:10" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical:10/invocations" -> (known after apply)
      ~ runtime                        = "python3.11" -> "python3.8"
        tags                           = {}
      ~ version                        = "10" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_critical.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notify-slack-critical"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:sns:ca-central-1:239043911459:alert-critical"
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # module.notify_slack_critical.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_critical/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/18468d9b9b27e11ad9afde31a6a9771f5e726075d8792ba12d455202868bcc35.zip"
              + runtime       = "python3.8"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/18468d9b9b27e11ad9afde31a6a9771f5e726075d8792ba12d455202868bcc35.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_critical.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7533743913943756388" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/1e622be40890679d302c03a6096c334d64151aab5aee3e073035598ee5e01db2.zip" -> "builds/18468d9b9b27e11ad9afde31a6a9771f5e726075d8792ba12d455202868bcc35.zip"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_general.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "notify-slack-general"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-general:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-general:8/invocations" -> (known after apply)
      ~ runtime                        = "python3.11" -> "python3.8"
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_general.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notify-slack-general"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:sns:ca-central-1:239043911459:alert-general"
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # module.notify_slack_general.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_general/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/e8b93d66dbf2c7ef2479acf0c5f9890c23c1fcd432e81da57f3f5b5ec1061753.zip"
              + runtime       = "python3.8"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e8b93d66dbf2c7ef2479acf0c5f9890c23c1fcd432e81da57f3f5b5ec1061753.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_general.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1724043044147037235" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2c26292ef7673e1f67a17eeecb7e7e2729a987663fdec0eb8f3028fce40d5ab4.zip" -> "builds/e8b93d66dbf2c7ef2479acf0c5f9890c23c1fcd432e81da57f3f5b5ec1061753.zip"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "notify-slack-ok"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok:4/invocations" -> (known after apply)
      ~ runtime                        = "python3.11" -> "python3.8"
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notify-slack-ok"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:sns:ca-central-1:239043911459:alert-ok"
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # module.notify_slack_ok.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_ok/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/7877f6dfc99e932437e08c1de7ba322bc1d72a6f3fe5b5c5e8b6eacee4f239eb.zip"
              + runtime       = "python3.8"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7877f6dfc99e932437e08c1de7ba322bc1d72a6f3fe5b5c5e8b6eacee4f239eb.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_ok.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4872499417064595275" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c0bc8d02f0098b178b87a31e448515f17dfa6165f117bbeca9526aa66b9266f3.zip" -> "builds/7877f6dfc99e932437e08c1de7ba322bc1d72a6f3fe5b5c5e8b6eacee4f239eb.zip"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "notify-slack-warning"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning:10" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning:10/invocations" -> (known after apply)
      ~ runtime                        = "python3.11" -> "python3.8"
        tags                           = {}
      ~ version                        = "10" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notify-slack-warning"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:sns:ca-central-1:239043911459:alert-warning"
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # module.notify_slack_warning.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_warning/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/b02ab3a0ae7399c2cfa86e739b9fa00da6ec254197e68e97db7a6f04baae10d0.zip"
              + runtime       = "python3.8"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/b02ab3a0ae7399c2cfa86e739b9fa00da6ec254197e68e97db7a6f04baae10d0.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_warning.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "10609948306762052" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/19863096150fa1a6df6f86bf4faddd68a0875c2a3c199bd42c44f533dcd009d3.zip" -> "builds/b02ab3a0ae7399c2cfa86e739b9fa00da6ec254197e68e97db7a6f04baae10d0.zip"
            # (1 unchanged element hidden)
        }
    }

Plan: 16 to add, 5 to change, 4 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 69 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
